{"class_name": "Sequential", "keras_version": "1.0.6", "loss": "sparse_categorical_crossentropy", "sample_weight_mode": null, "config": [{"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "bias": true, "input_dtype": "float32", "name": "dense_52", "W_constraint": null, "b_constraint": null, "activation": "linear", "input_dim": null, "activity_regularizer": null, "output_dim": 512, "init": "glorot_uniform", "b_regularizer": null, "batch_input_shape": [null, 152]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_52"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_35"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l2": 0.10000000149011612, "l1": 0.0, "name": "WeightRegularizer"}, "trainable": true, "bias": true, "output_dim": 512, "name": "dense_53", "W_constraint": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_53"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_36"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "bias": true, "output_dim": 2, "name": "dense_54", "W_constraint": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_54"}}], "optimizer": {"nesterov": false, "momentum": 0.0, "lr": 0.009999999776482582, "decay": 0.0, "name": "SGD"}}