{"config": [{"config": {"b_constraint": null, "output_dim": 512, "batch_input_shape": [null, 152], "input_dim": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dtype": "float32", "W_regularizer": null, "name": "dense_16", "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_11", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "output_dim": 512, "input_dim": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": {"l2": 0.10000000149011612, "l1": 0.0, "name": "WeightRegularizer"}, "name": "dense_17", "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_12", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "output_dim": 2, "input_dim": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_18", "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_18", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "1.0.6", "class_name": "Sequential", "loss": "sparse_categorical_crossentropy", "optimizer": {"decay": 0.0, "name": "SGD", "nesterov": false, "lr": 0.009999999776482582, "momentum": 0.0}, "sample_weight_mode": null}